# Introduction to Pandas Library

What is Pandas?
In the real world, datasets are dirty. This data must be preprocessed before data analysis. Data preprocessing is one of the most important stages of data analysis. The most time-consuming step for data scientists is data preprocessing. Pandas is one of the most important libraries of Python. In this post, I’ll talk about Pandas library.

Pandas is an important library for data preprocessing. Pandas often uses libraries such as NumPy and SciPy for numerical computations and Matplotlib to visualize data. Pandas has methods similar to the methods in NumPy. While NumPy works with the same data types, Pandas can work with different data types.

Installing Pandas
If you are using platforms such as Anaconda, Pandas comes preinstalled. To install Pandas on your computer, you can use the following code:

pip install pandas

In [1]:
#Pandas and dependent libraries are automatically installed with this code.
#To use Pandas it is necessary to import. Let’s import Pandas:
import pandas as pd

In [2]:
pd.__version__

'1.4.4'

Pandas has data structures. These are Series and DataFrame. Series is one-dimensional, that is, it consists of a column. DataFrame is two-dimensional, it consists of rows and columns

# 1] Series Data Structure

Series is a one-dimensional object and represents a column:

In [3]:
obj=pd.Series([1,"tanmay",3.5])
obj
#The object’s index starts from 0:

0         1
1    tanmay
2       3.5
dtype: object

In [5]:
obj[1]

'tanmay'

In [6]:
#If you want to change data types as an array, use the values method:
obj.values

array([1, 'tanmay', 3.5], dtype=object)

In [7]:
#change the indexes:
obj2=pd.Series([1,"tanmay",3.5],index=["a","b","c"])
obj2

a         1
b    tanmay
c       3.5
dtype: object

In [8]:
obj2.index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
#convert data types such as list, tuple, or dictionary to Series structure:
score={"tanmay":20,"tanish":18}
names=pd.Series(score)
names

tanmay    20
tanish    18
dtype: int64

In [13]:
names["tanmay"]

20

In [14]:
names[names>=18]
names

tanmay    20
tanish    18
dtype: int64

In [15]:
#change value and You can change more than one value:
names["tanmay"]=22
names

tanmay    22
tanish    18
dtype: int64

In [16]:
#check if a value exists in the dataset:
"tanmay" in names

True

In [17]:
#mathematical operations to Series:
names/2

tanmay    11.0
tanish     9.0
dtype: float64

In [18]:
#To see missing data, you can the isnull method:
names.isnull()

tanmay    False
tanish    False
dtype: bool

# Working with Series

In [19]:
games=pd.read_csv("vgsalesGlobale.csv")

In [20]:
games.head()#print first five

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [29]:
#types of variables in the dataset.
games.dtypes

Rank              int64
Name             object
Platform         object
Year            float64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

The describe() function in pandas provides a summary of statistics pertaining to the DataFrame columns.
count: The number of non-null entries in the Genre column.
unique: The number of unique genres.
top: The most frequently occurring genre.
freq: The frequency of the most common genre.

In [30]:
#print the definitive statistics of the genre variable.
games.Genre.describe()

count      16598
unique        12
top       Action
freq        3316
Name: Genre, dtype: object

In [31]:
#number of subcategories inside the variable.
games.Genre.value_counts()

Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: Genre, dtype: int64

In [33]:
#Genre’s type.--> series
type(games.Genre.value_counts())

pandas.core.series.Series

In [34]:
games.Genre.value_counts().head()

Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Name: Genre, dtype: int64

In [36]:
games.Genre.unique()

array(['Sports', 'Platform', 'Racing', 'Role-Playing', 'Puzzle', 'Misc',
       'Shooter', 'Simulation', 'Action', 'Fighting', 'Adventure',
       'Strategy'], dtype=object)

In [37]:
#how many single values using nunique method:
games.Genre.nunique()

12

To dispaly the mutual values of two variables as a table, you can use crosstab method.

In [41]:
pd.crosstab(games.Genre,games.Year).head()

Year,1980.0,1981.0,1982.0,1983.0,1984.0,1985.0,1986.0,1987.0,1988.0,1989.0,...,2009.0,2010.0,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2020.0
Genre,,,,,,,,,,,,,,,,,,,,,
Action,1,25,18,7,1,2,6,2,2,2,...,272,226,239,266,148,186,255,119,1,0
Adventure,0,0,0,1,0,0,0,1,0,0,...,141,154,108,58,60,75,54,34,0,0
Fighting,1,0,0,0,0,1,0,2,0,0,...,53,40,50,29,20,23,21,14,0,0
Misc,4,0,1,1,1,0,0,0,0,1,...,207,201,184,38,42,41,39,18,0,0
Platform,0,3,5,5,1,4,6,2,4,3,...,29,31,37,12,37,10,14,10,0,0

In [42]:
#definitive statistics of Global_Sales variable.

games.Global_Sales.describe()

count    16598.000000
mean         0.537441
std          1.555028
min          0.010000
25%          0.060000
50%          0.170000
75%          0.470000
max         82.740000
Name: Global_Sales, dtype: float64

count: 16,598, which means there are 16,598 entries in the Global_Sales column.
mean: 0.537441, the average global sales per game.
std (standard deviation): 1.555028, which measures the amount of variation or dispersion of the sales data.
min: 0.010000, the minimum global sales value.
25% (first quartile): 0.060000, 25% of the games have global sales less than or equal to 0.060000.
50% (median): 0.170000, 50% of the games have global sales less than or equal to 0.170000.
75% (third quartile): 0.470000, 75% of the games have global sales less than or equal to 0.470000.
max: 82.740000, the maximum global sales value.

In [ ]:
# histogram of the Year, a numeric type.

games.Year.plot(kind="hist")

# 2] DataFrame

In [46]:
#Series consisted of one column and DataFrame consists of multiple columns.
data={"name":["tanmay","ja","hjj"],
      "score":[90,67,89],
      "skill":["data analyst","web","android"]
     
     }

In [49]:
df=pd.DataFrame(data)
df

     name  score         skill
0  tanmay     90  data analyst
1      ja     67           web
2     hjj     89       android

In [51]:
#Exchanging column order
#we can add new column also in this array

df=pd.DataFrame(data,columns=["name","skill","score"])
df

     name         skill  score
0  tanmay  data analyst     90
1      ja           web     67
2     hjj       android     89

In [54]:
#To select specific rows, you can use the loc method:

df.loc[[1]]

  name skill  score
1   ja   web     67

In [55]:
df.loc[[0,2]]

     name         skill  score
0  tanmay  data analyst     90
2     hjj       android     89

You can assign a list or array to a column. Note that the length of the values must be the same as the DataFrame length:

In [59]:
df=pd.DataFrame(data,columns=["name","skill","score","age"])

value=[15,16,23]
df["age"]=value
df

     name         skill  score  age
0  tanmay  data analyst     90   15
1      ja           web     67   16
2     hjj       android     89   23

In [60]:
df["first class"]=df.score>=85
df

     name         skill  score  age  first class
0  tanmay  data analyst     90   15         True
1      ja           web     67   16        False
2     hjj       android     89   23         True

In [62]:
#delete the pass column:
del df["first class"]
df

     name         skill  score  age
0  tanmay  data analyst     90   15
1      ja           web     67   16
2     hjj       android     89   23

In [63]:
#transpose dataset(row-->column vice versa)

transpose_df=df
transpose_df.T

                  0    1        2
name         tanmay   ja      hjj
skill  data analyst  web  android
score            90   67       89
age              15   16       23

In [67]:
transpose_df.index.name="name"
transpose_df.columns.name="lesson"

In [68]:
transpose_df.values

array([['tanmay', 'data analyst', 90, 15],
       ['ja', 'web', 67, 16],
       ['hjj', 'android', 89, 23]], dtype=object)

The index attribute makes the data immutable. The user can no longer make changes to the data.

In [70]:
transpose_index=transpose_df.index

In [71]:
transpose_index[1]="jac"
transpose_index

TypeError: Index does not support mutable operations

# Indexing & Selecting & Filtering in Pandas

In [72]:
import numpy as np

In [74]:
#To index data, you can the square brackets. 
#To show this, let’s create a series using the arrange method.

obj=pd.Series(np.arange(4),index=["a","b","c","d"])
obj

a    0
b    1
c    2
d    3
dtype: int32

# 1] Working with Index in Series

In [75]:
obj["b"]

1

In [76]:
obj[1]

1

In [77]:
#You can slice the data.
obj[0:2]

a    0
b    1
dtype: int32

# 2] Selecting in Series

In [78]:
#select the specific rows.
obj[["a","c"]]

a    0
c    2
dtype: int32

In [79]:
#same thing by using the index number.
obj[[0,2]]

a    0
c    2
dtype: int32

# 3] Filtering in Series

In [80]:
obj[obj<2]

a    0
b    1
dtype: int32

In [81]:
obj["a":"c"]

a    0
b    1
c    2
dtype: int32

In [83]:
#assign a value to the sliced piece.
obj["b":"c"]=4
obj

a    0
b    4
c    4
d    3
dtype: int32

# 4] Selecting in DataFrame

In [84]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                  index=["india","uk","usa","ny"],
                  columns=["one","two","three","four"])

data

       one  two  three  four
india    0    1      2     3
uk       4    5      6     7
usa      8    9     10    11
ny      12   13     14    15

This DataFrame has 4 rows and 4 columns, with the index set to the countries/locations ("india", "uk", "usa", "ny") and the columns labeled as "one", "two", "three", and "four". The values are generated using np.arange(16).reshape(4, 4), which creates an array of numbers from 0 to 15 and reshapes it into a 4x4 matrix.

In [85]:
#column named two.

data["two"]

india     1
uk        5
usa       9
ny       13
Name: two, dtype: int32

In [86]:
#select more than one column.

data[["one","three"]]

       one  three
india    0      2
uk       4      6
usa      8     10
ny      12     14

In [87]:
data[:3]

       one  two  three  four
india    0    1      2     3
uk       4    5      6     7
usa      8    9     10    11

# 5] Filtering in DataFrame

In [88]:
data[data["four"]>5]

     one  two  three  four
uk     4    5      6     7
usa    8    9     10    11
ny    12   13     14    15

In [97]:
data[data<5]=1
data

       one  two  three  four
india    1    1      1     1
uk       1    5      6     7
usa      8    9     10    11
ny      12   13     14    15

# 6] Selecting with iloc and loc methods

In [92]:
#iloc method to select a row using the row’s index.

data.iloc[1]

one      1
two      5
three    6
four     7
Name: uk, dtype: int32

In [93]:
#select the specific columns of the row.
data.iloc[1,[1,2]]

two      5
three    6
Name: uk, dtype: int32

In [94]:
#select specific columns of multiple rows.
data.iloc[[1,3],[1,2]]

    two  three
uk    5      6
ny   13     14

In [95]:
#At the loc method. You need to use names for loc.
data.loc["india",["one","three"]]

one      1
three    1
Name: india, dtype: int32

In [98]:
#select the rows up to usa and the column named four.

data.loc[:"usa","three"]

india     1
uk        6
usa      10
Name: three, dtype: int32

In [100]:
#To show how to use the negative index, let me create a Series named toy_data.To show how to use the negative index, let me create a Series named toy_data.

toy_data=pd.Series(np.arange(5),index=["a","b","c","d","e"])

toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [103]:
toy_data[-1] #last index

4

# Some Useful Methods in Pandas

In [105]:
#Pandas has very important methods used in data analysis, 
#data cleaning, and data preprocessing.

s=pd.Series([1,2,3,4],index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [106]:
s["a"]

1

# 1] The reindex method
You can use the reindex method to rearrange the data according to the indexes.

In [107]:
s2=s.reindex(["b","d","c","a"])
s2

b    2
d    4
c    3
a    1
dtype: int64

You can assign empty values with the reindex method. To show that, let me create a variable named s3.

To fill the empty values in the s3, you can use the fill option.

In [108]:
s3=pd.Series(["blue","yellow","purple"],index=[0,2,4])
s3

0      blue
2    yellow
4    purple
dtype: object

In [112]:
s3.reindex(range(6),method="ffill")

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

To show how to use reindex method in a data frame, let’s create a variable named df.

In [113]:
df=pd.DataFrame(np.arange(9).reshape(3,3),
                index=["a","c","d"],
                columns=["tim","tom","toe"])
df

   tim  tom  toe
a    0    1    2
c    3    4    5
d    6    7    8

In [114]:
#You can use the reindex method to relocate rows.

df1=df.reindex(["a","b","c","d"])
df1

   tim  tom  toe
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [115]:
#You can use the reindex method to relocate columns using columns.
names=["toe","tim","tom"]
df.reindex(columns=names)

   toe  tim  tom
a    2    0    1
c    5    3    4
d    8    6    7

In [117]:
#You can also reindex rows with the loc method.

df1.loc[["c","a","b"]]

   tim  tom  toe
c  3.0  4.0  5.0
a  0.0  1.0  2.0
b  NaN  NaN  NaN

# 2] The drop method

In [2]:
import pandas as pd
import numpy as np

In [5]:
s=pd.Series(np.arange(5.),index=["a","b","c","d","e"])
s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [6]:
#delete any row or column with the drop method.
#We can delete more than one row with the drop method.

s1=s.drop("b")
s1

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

You can also use the drop method for a data frame. To illustrate this, let’s create a variable named data.

In [8]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                  index=["aba","bb","ca","ds"],
                  columns=list("ABCD"))
data

      A   B   C   D
aba   0   1   2   3
bb    4   5   6   7
ca    8   9  10  11
ds   12  13  14  15

To delete any column, you can use the axis = 1 parameter and to delete any row, you can the axis = 0 parameter.

In [9]:
data.drop("A",axis=1) #to delete column

      B   C   D
aba   1   2   3
bb    5   6   7
ca    9  10  11
ds   13  14  15

In [10]:
data.drop("bb",axis=0) #to delete row

      A   B   C   D
aba   0   1   2   3
ca    8   9  10  11
ds   12  13  14  15

# 3] The mean method
To mean the columns, you can use the mean method with the axis argument

In [11]:
data.mean(axis="index") # mean of individual column

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [12]:
data.mean(axis="columns") # mean of individual row

aba     1.5
bb      5.5
ca      9.5
ds     13.5
dtype: float64

# Arithmetic Operations in Pandas

In [14]:
s1=pd.Series(np.arange(4),index=["a","c","d","e"])
s2=pd.Series(np.arange(5),index=["a","c","e","f","g"])

print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

# 1] Addition in Pandas

In [15]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

You can do the same for the data frame. To show this, let’s create two datasets named df1 and df2.

In [23]:
df1=pd.DataFrame(np.arange(6).reshape(2,3),
                  index=["aba","bb"],
                  columns=list("ABC"))
df2=pd.DataFrame(np.arange(9).reshape(3,3),
                  index=["aba","ba","ca"],
                  columns=list("ACD"))
print(df1)
print("................")
print(df2)

     A  B  C
aba  0  1  2
bb   3  4  5
................
     A  C  D
aba  0  1  2
ba   3  4  5
ca   6  7  8

In [18]:
df1+df2

       A   B    C   D
aba  0.0 NaN  3.0 NaN
ba   NaN NaN  NaN NaN
bb   NaN NaN  NaN NaN
ca   NaN NaN  NaN NaN

When you can apply arithmetic operations with different indexes, a special value such as zero can be assigned to the missing values.

Let’s assign zeros to values that do not match df2 of df1 when adding two data frames.

In [19]:
df1.add(df2,fill_value=0)

       A    B    C    D
aba  0.0  1.0  3.0  2.0
ba   3.0  NaN  4.0  5.0
bb   3.0  4.0  5.0  NaN
ca   6.0  NaN  7.0  8.0

# 2] Multiplication & Division in Pandas

In [20]:
#You can inverse the values in the dataset.
1/df1 #inf=infinite value

            A     B    C
aba       inf  1.00  0.5
bb   0.333333  0.25  0.2

In [21]:
df1*3  #or df1.mul(3)

     A   B   C
aba  0   3   6
bb   9  12  15

In [24]:
df2

     A  C  D
aba  0  1  2
ba   3  4  5
ca   6  7  8

In [27]:
s=df2.iloc[1]
s

A    3
C    4
D    5
Name: ba, dtype: int32

In [28]:
#As you can see, this row is in Serial structure. Let’s subtract s from df2.

df2-s

     A  C  D
aba -3 -3 -3
ba   0  0  0
ca   3  3  3

In [29]:
s2=df2["A"]
#You can perform arithmetic operations with a series and a data frame.

df2.sub(s2,axis="index")

     A  C  D
aba  0  1  2
ba   0  1  2
ca   0  1  2

# 3] Applying a Function in Pandas
You can use NumPy functions with Pandas data structures To demonstrate this, let’s first create a dataset named df.

In [41]:
df=pd.DataFrame(np.random.randn(4,3),
                columns=list("ABC"),
                index=["ko","ki","ka","ku"])
df
#Note that the actual values will vary each time you run the code due to the use of random numbers.

           A         B         C
ko  1.556786 -0.930952  0.126067
ki  1.110308  1.993976 -0.817184
ka -0.526211 -0.820940 -1.434912
ku  0.059424 -0.596680  0.870675

In [42]:
np.abs(df)

           A         B         C
ko  1.556786  0.930952  0.126067
ki  1.110308  1.993976  0.817184
ka  0.526211  0.820940  1.434912
ku  0.059424  0.596680  0.870675

You can also apply a function for each column or row. To do this, you can use the apply () method.

In [43]:
f=lambda x:x.max()-x.min()

In [44]:
df.apply(f)

A    2.082997
B    2.924928
C    2.305587
dtype: float64

In [45]:
#execute this function on each row using axis = 1.
df.apply(f,axis=1)

ko    2.487738
ki    2.811160
ka    0.908701
ku    1.467355
dtype: float64